app/Controllers/Admin/ConsultaController.php

SELECT *
FROM `consultas`
ORDER BY `estado` ASC, `id_consulta` DESC
---
    public function index()
    {
        $model = new ConsultaModel();
        $data['consultas'] = $model->orderBy('estado', 'ASC')->orderBy('id_consulta', 'DESC')->findAll();