app/Controllers/Admin/ProductoController.php

    public function index()
    {
        $model = new ProductoModel();

        $busqueda = $this->request->getGet('busqueda');

        $query = $productoModel = $model
            ->select('productos.*, marcas.marca_nombre')
            ->join('marcas', 'marcas.id_marca = productos.id_marca');

        if ($busqueda) {
            $query->groupStart()
                ->like('producto_nombre', $busqueda)
                ->orLike('productos.id_producto', $busqueda)
                ->orLike('marcas.marca_nombre', $busqueda)
                ->groupEnd();
        }

        $data['productos'] = $query->findAll();
---
SELECT `productos`.*, `marcas`.`marca_nombre`
FROM `productos`
JOIN `marcas` ON `marcas`.`id_marca` = `productos`.`id_marca`

    public function editar($id)
    {
        $model = new ProductoModel();
        $marcaModel = new MarcaModel();
        $data['producto'] = $model->find($id);
        $data['marcas'] = $marcaModel->where('marca_estado', 1)->findAll();
---
SELECT *
FROM `marcas`
WHERE `marca_estado` = 1

    public function actualizar($id){

        $rules = [
            'producto_nombre'      => 'required|min_length[2]',
            'producto_descripcion' => 'required|min_length[10]',
            'producto_precio'      => 'required|decimal',
            'producto_stock'       => 'required|integer',
            'id_marca'             => 'required'
        ];
        $messages = [
            'producto_nombre'      => ['required' => 'El nombre es obligatorio.', 'min_length' => 'El nombre debe tener al menos 2 caracteres.'],
            'producto_descripcion' => ['required' => 'La descripción es obligatoria.', 'min_length' => 'La descripción debe tener al menos 10 caracteres.'],
            'producto_precio'      => ['required' => 'El precio es obligatorio.', 'decimal' => 'El precio debe ser un número válido.'],
            'producto_stock'       => ['required' => 'El stock es obligatorio.', 'integer' => 'El stock debe ser un número entero.'],
            'id_marca'             => ['required' => 'La marca es obligatoria.']
        ];

        if (!$this->validateData($this->request->getPost(), $rules, $messages)) {
            $marcaModel = new MarcaModel();
            $model = new ProductoModel();
            $data['errores'] = $this->validator->getErrors();
            $data['producto'] = $model->find($id);
            $data['marcas'] = $marcaModel->where('marca_estado', 1)->findAll();
---
SELECT *
FROM `marcas`
WHERE `marca_estado` = 1