app/Controllers/Admin/VentaController.php

    public function index()
    {
        $ventaModel = new VentaModel();

        $fecha_desde = $this->request->getGet('fecha_desde');
        $fecha_hasta = $this->request->getGet('fecha_hasta');

        $query = $ventaModel
            ->select('ventas.*, usuarios.usuario_nombre, usuarios.usuario_apellido')
            ->join('usuarios', 'usuarios.id_usuario = ventas.id_usuario')
            ->orderBy('venta_fecha', 'DESC');

        if ($fecha_desde) {
            $query->where('venta_fecha >=', $fecha_desde . ' 00:00:00');
        }
        if ($fecha_hasta) {
            $query->where('venta_fecha <=', $fecha_hasta . ' 23:59:59');
        }

        $data['ventas'] = $query->findAll();
---
SELECT `ventas`.*, `usuarios`.`usuario_nombre`, `usuarios`.`usuario_apellido`
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas`.`id_usuario`
ORDER BY `venta_fecha` DESC