app/Controllers/CatalogoController.php

    public function index()
    {
        $productoModel = new ProductoModel();
        $marcaModel = new MarcaModel();

        $marca = $this->request->getGet('marca');

        $query = $productoModel
            ->select('productos.*, marcas.marca_nombre')
            ->join('marcas', 'marcas.id_marca = productos.id_marca')
            ->where('producto_estado', 1);

        if ($marca) {
            $query->where('productos.id_marca', $marca);
        }

        $data['productos'] = $query->findAll();
        $data['marcas'] = $marcaModel->where('marca_estado', 1)->findAll();
---
SELECT `productos`.*, `marcas`.`marca_nombre`
FROM `productos`
JOIN `marcas` ON `marcas`.`id_marca` = `productos`.`id_marca`
WHERE `producto_estado` = 1
AND `productos`.`id_marca` = '1'
SELECT *
FROM `marcas`
WHERE `marca_estado` = 1

    public function detalle($id)
    {
        $productoModel = new ProductoModel();
        $data['producto'] = $productoModel
            ->select('productos.*, marcas.marca_nombre')
            ->join('marcas', 'marcas.id_marca = productos.id_marca')
            ->where('id_producto', $id)
            ->first();
---
SELECT `productos`.*, `marcas`.`marca_nombre`
FROM `productos`
JOIN `marcas` ON `marcas`.`id_marca` = `productos`.`id_marca`
WHERE `id_producto` = '2'
 LIMIT 1