app/Controllers/CheckoutController.php

INSERT INTO `ventas` (`id_usuario`, `total`, `venta_estado`) VALUES ('5', 1799999, 1)
---

        // Crear venta
        $ventaModel = new VentaModel();
        $id_venta = $ventaModel->insert([
            'id_usuario'   => $id_usuario,
            'total'        => $total,
            'venta_estado' => 1
        ], true);

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'
UPDATE `productos` SET `producto_stock` = 12
WHERE `productos`.`id_producto` IN ('4')
---
                'precio_unitario' => $item['producto_precio']
            ]);

            $producto = $productoModel->find($item['id_producto']);
            $productoModel->update($item['id_producto'], [
                'producto_stock' => $producto['producto_stock'] - $item['cantidad']
            ]);

INSERT INTO `facturas` (`id_venta`, `total`) VALUES (13, 1799999)
---

        // Crear factura
        $facturaModel = new FacturaModel();
        $id_factura = $facturaModel->insert([
            'id_venta' => $id_venta,
            'total'    => $total
        ], true);

SELECT *
FROM `facturas`
WHERE `facturas`.`id_factura` = '10'
SELECT *
FROM `ventas`
WHERE `ventas`.`id_venta` = '13'
SELECT `detalle_ventas`.*, `productos`.`producto_nombre`
FROM `detalle_ventas`
JOIN `productos` ON `productos`.`id_producto` = `detalle_ventas`.`id_producto`
WHERE `id_venta` = '13'
---
    public function factura($id_factura){
        $facturaModel = new FacturaModel();
        $ventaModel = new VentaModel();
        $detalleModel = new DetalleVentaModel();

        $factura = $facturaModel->find($id_factura);
        $venta = $ventaModel->find($factura['id_venta']);

        $detalles = $detalleModel
            ->select('detalle_ventas.*, productos.producto_nombre')
            ->join('productos', 'productos.id_producto = detalle_ventas.id_producto')
            ->where('id_venta', $factura['id_venta'])
            ->findAll();