app/Controllers/HistorialController.php

SELECT *
FROM `ventas`
WHERE `ventas`.`id_venta` = '8'
SELECT *
FROM `facturas`
WHERE `id_venta` = '8'
 LIMIT 1
SELECT `detalle_ventas`.*, `productos`.`producto_nombre`
FROM `detalle_ventas`
JOIN `productos` ON `productos`.`id_producto` = `detalle_ventas`.`id_producto`
WHERE `id_venta` = '8'
---
    public function detalle($id_venta)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login');
        }

        $ventaModel = new VentaModel();
        $detalleModel = new DetalleVentaModel();
        $facturaModel = new FacturaModel();

        $venta = $ventaModel->find($id_venta);

        // Seguridad: verificar que la venta sea del usuario logueado
        if ($venta['id_usuario'] != session()->get('id_usuario')) {
            return redirect()->to('/historial');
        }

        $data['venta'] = $venta;
        $data['factura'] = $facturaModel->where('id_venta', $id_venta)->first();
        $data['detalles'] = $detalleModel
            ->select('detalle_ventas.*, productos.producto_nombre')
            ->join('productos', 'productos.id_producto = detalle_ventas.id_producto')
            ->where('id_venta', $id_venta)
            ->findAll();