app/Controllers/Home.php

    public function index()
    {
        $productoModel = new ProductoModel();
        $data['productos_destacados'] = $productoModel
            ->select('productos.*, marcas.marca_nombre')
            ->join('marcas', 'marcas.id_marca = productos.id_marca')
            ->where('producto_estado', 1)
            ->orderBy('id_producto', 'DESC')
            ->limit(6)
            ->findAll();
---
SELECT `productos`.*, `marcas`.`marca_nombre`
FROM `productos`
JOIN `marcas` ON `marcas`.`id_marca` = `productos`.`id_marca`
WHERE `producto_estado` = 1
ORDER BY `id_producto` DESC