app/Models/UsuarioModel.php

    public function obtenerPorEmail($email){
        try {
            return $this->where('usuario_email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario_email` = 'Admin@gmail.com'
 LIMIT 1